# Дана непустая сторока. Вывести коды ее первого и последнего символа.

string = 'Hello, World!'

print('Код первого символа:', ord(string[0]))
print('Код последнего символа:', ord(string[-1]))
