info_medicines=[
    (1, 'Стрепсилс Интенсив', 'таблетки', 50, 168, 'Россия'),
    (2, 'Грамидин', 'спрей', 25, 649, 'Россия'),
    (3, 'Септолете Тотал', 'таблетки', 54, 470, 'Словения'),
    (4, 'Гексорал', 'таблетки', 14, 359, 'США'),
    (5, 'Виброцил', 'спрей', 32, 679, 'Россия'),
    (6, 'Омез', 'капсулы', 35, 89, 'Индия'),
    (7, 'Синупрет', 'капли', 46, 749, 'Германия'),
    (8, 'Арбидол', 'капсулы', 23, 629, 'Россия'),
    (9, 'Визин', 'капли', 41, 629, 'Россия'),
    (10, 'Мезим', 'таблетки', 29, 399, 'Германия'),
]